In [2]:
import pandas as pd
df=pd.read_csv('Churn_Modelling.csv')
df.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [3]:
df.isnull().sum()

RowNumber          0
CustomerId         0
Surname            0
CreditScore        0
Geography          0
Gender             0
Age                0
Tenure             0
Balance            0
NumOfProducts      0
HasCrCard          0
IsActiveMember     0
EstimatedSalary    0
Exited             0
dtype: int64

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   RowNumber        10000 non-null  int64
 1   CustomerId       10000 non-null  int64
 2   Surname          10000 non-null  object
 3   CreditScore      10000 non-null  int64
 4   Geography        10000 non-null  object
 5   Gender           10000 non-null  object
 6   Age              10000 non-null  int64
 7   Tenure           10000 non-null  int64
 8   Balance          10000 non-null  float64
 9   NumOfProducts    10000 non-null  int64
 10  HasCrCard        10000 non-null  int64
 11  IsActiveMember   10000 non-null  int64
 12  EstimatedSalary  10000 non-null  float64
 13  Exited           10000 non-null  int64
dtypes: float64(2), int64(9), object(3)
memory usage: 1.1+ MB

In [5]:
df.duplicated().sum()# is there any duplicate element

np.int64(0)

In [6]:
df['Exited'].value_counts() # imbalance dataset

Exited
0    7963
1    2037
Name: count, dtype: int64

In [7]:
print(df['Gender'].value_counts()) 
print(df['Geography'].value_counts())

Gender
Male      5457
Female    4543
Name: count, dtype: int64
Geography
France     5014
Germany    2509
Spain      2477
Name: count, dtype: int64

In [8]:
cols=['Surname']
df.drop(columns=cols,inplace=True)

In [9]:
df.head()

,RowNumber,CustomerId,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [10]:
df2 = pd.get_dummies(df, columns=['Geography', 'Gender'], drop_first=True)
df2 = df2.astype(int)
df2.head()

,RowNumber,CustomerId,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,Geography_Germany,Geography_Spain,Gender_Male
0,1,15634602,619,42,2,0,1,1,1,101348,1,0,0,0
1,2,15647311,608,41,1,83807,1,0,1,112542,0,0,1,0
2,3,15619304,502,42,8,159660,3,1,0,113931,1,0,0,0
3,4,15701354,699,39,1,0,2,0,0,93826,0,0,0,0
4,5,15737888,850,43,2,125510,1,1,1,79084,0,0,1,0

In [11]:
x=df2.drop(columns=['Exited'])
y=df['Exited']

In [12]:
from sklearn.model_selection import train_test_split
xtrain,xtest,ytrain,ytest=train_test_split(x,y,test_size=0.2,random_state=1)

In [13]:
from sklearn.preprocessing import StandardScaler
scaler=StandardScaler()
xtrain_scaled=scaler.fit_transform(xtrain)
xtest_scaled=scaler.transform(xtest)

In [14]:
pd.DataFrame(xtrain_scaled).head()

,0,1,2,3,4,5,6,7,8,9,10,11,12
0,-0.805319,0.424000,-0.230820,-0.944500,-0.701742,0.588164,0.802257,-1.553374,0.977259,0.427402,1.714901,-0.572731,0.915091
1,0.042479,-1.024969,-0.251509,-0.944500,-0.355203,0.469851,0.802257,-1.553374,-1.023271,-1.025493,-0.583124,-0.572731,-1.092788
2,-0.848992,1.182302,-0.396330,0.774987,0.337876,0.858782,-0.911510,0.643760,0.977259,-0.944793,1.714901,-0.572731,-1.092788
3,-0.466685,-1.040660,-0.044622,1.252622,0.337876,0.565605,0.802257,-1.553374,0.977259,-0.551941,1.714901,-0.572731,-1.092788
4,0.835167,-0.369831,0.658795,-0.562392,1.030954,0.730400,-0.911510,-1.553374,-1.023271,1.083388,-0.583124,1.746019,0.915091